# Настройки датчиков и интервалов опроса

TARGET_MAC_LIST = [
    "A4:C1:38:53:82:0F",  # Улица
    "A4:C1:38:51:C3:0D",  # Подвал
    "A4:C1:38:10:3B:D1"   # Спальня (кухня)
]

NAME_SENSOR = {
    "A4:C1:38:53:82:0F": "Улица",
    "A4:C1:38:51:C3:0D": "Подвал",
    "A4:C1:38:10:3B:D1": "Спальня (кухня)"
}

INTERVAL_SECONDS = 60

# Физические параметры для расчетов
T_FLOOR_DIFF = 4.5  # Разница температур между воздухом в подвале и самым холодным углом пола
TARGET_RH = 74.0    # Целевая относительная влажность у пола для предотвращения плесени

# Параметры запуска веб-сервера
SERVER_HOST = "0.0.0.0"
SERVER_PORT = 8000